Netology/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>215</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>215</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>26</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

Netology/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Netology/src/Catalogs/Контрагенты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Тип           = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	Ответственный = СотрудникиСервер.СотрудникТекущегоПользователя();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоЮридическоеЛицо       = (Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	ВведенныеДанныеКорректны = Истина;
	УказанныйИННКорректен    = Истина;
	УказанныйКППКорректен    = Истина;
	
	Если ЭтоЮридическоеЛицо Тогда
		
		Если НЕ (ЗначениеЗаполнено(ИНН) И ЗначениеЗаполнено(КПП)) Тогда
			
			Сообщить("Для юридического лица ИНН и КПП должны быть заполнены.");
			
			ВведенныеДанныеКорректны = Ложь;
			
		КонецЕсли;
		
		Если СтрДлина(ИНН) <> 10 Тогда
			
			Сообщить("Длина ИНН должна быть 10 символов.");
			
			УказанныйИННКорректен = Ложь;
			
		КонецЕсли;

		Если СтрДлина(КПП) <> 9 Тогда
			
			Сообщить("Длина КПП должна быть 9 символов.");
			
			УказанныйКППКорректен = Ложь;
			
		КонецЕсли;

	Иначе
		
		Если НЕ ЗначениеЗаполнено(ИНН) ИЛИ ЗначениеЗаполнено(КПП) Тогда
			
			Сообщить("Для физического лица ИНН должно быть заполнено, КПП не указывается.");
			
			ВведенныеДанныеКорректны = Ложь;
			
		КонецЕсли;
		
		Если СтрДлина(ИНН) <> 12 Тогда
			
			Сообщить("Длина ИНН должна быть 12 символов.");
			
			УказанныйИННКорректен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;

	Если УказанныйИННКорректен Тогда
		
		Если ТолькоЦифрыВСтроке(ИНН) Тогда
			
			Если НЕ РаботаСИНН.ИННВерен(ИНН) Тогда
				
				Сообщить("ИНН не прошел проверку на контрольный символ. Проверьте введенные данные.");
			
				УказанныйИННКорректен = Ложь;
				
			КонецЕсли;

		Иначе
			
			Сообщить("ИНН может состоять только из цифр.");
			
			УказанныйИННКорректен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УказанныйКППКорректен И НЕ ТолькоЦифрыВСтроке(КПП) Тогда

		Сообщить("ИНН может состоять только из цифр.");
		
		УказанныйКППКорректен = Ложь;
			
	КонецЕсли;
	
	Отказ = НЕ (ВведенныеДанныеКорректны И УказанныйИННКорректен И УказанныйКППКорректен);
	
КонецПроцедуры

Функция ТолькоЦифрыВСтроке(СтрокаДляПроверки)
	
	СтрокаЦифр = "0123456789";
	
	Для Счетчик = 1 По СтрДлина(СтрокаДляПроверки) Цикл
		
		ТекущийСимвол = Сред(СтрокаДляПроверки, Счетчик, 1);
		
		Если СтрНайти(СтрокаЦифр, ТекущийСимвол) = 0 Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции
